# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\INSTALL\University\Units\2024_S1\FIT4701\Laser-Drawing\PSoC Code.cydsn\PSoC Code.cyprj
# Date: Wed, 15 May 2024 03:40:28 GMT
#set_units -time ns
create_clock -name {Clock_1(routed)} -period 83.333333333333329 -waveform {0 41.6666666666667} [list [get_pins {ClockBlock/dclk_0}]]
create_clock -name {SineWaveX_DacClk(routed)} -period 200000 -waveform {0 100000} [list [get_pins {ClockBlock/dclk_1}]]
create_clock -name {SineWaveY_DacClk(routed)} -period 200000 -waveform {0 100000} [list [get_pins {ClockBlock/dclk_2}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 3 5} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {SineWaveX_DacClk} -source [get_pins {ClockBlock/clk_sync}] -edges {1 4801 9601} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {SineWaveY_DacClk} -source [get_pins {ClockBlock/clk_sync}] -edges {1 4801 9601} [list [get_pins {ClockBlock/dclk_glb_2}]]


# Component constraints for C:\INSTALL\University\Units\2024_S1\FIT4701\Laser-Drawing\PSoC Code.cydsn\TopDesign\TopDesign.cysch
# Project: C:\INSTALL\University\Units\2024_S1\FIT4701\Laser-Drawing\PSoC Code.cydsn\PSoC Code.cyprj
# Date: Wed, 15 May 2024 03:40:24 GMT
